grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
/*
  VSCP Wireless CAN4VSCP Gateway (VSCP-WCANG)

  MQTT SSL/TLS Client Module

  This module implements MQTT client functionality for the VSCP gateway,
  supporting both standard MQTT and secure MQTT over TLS/SSL. It handles:
  - MQTT broker connection with configurable credentials
  - Publishing VSCP events as JSON payloads
  - Topic name template substitution (mustache-style tags)
  - TLS/SSL encryption with CA and client certificate authentication
  - Connection statistics and error tracking
  - Event logging via MQTT

  The MIT License (MIT)
  Copyright (C) 2022-2026 Ake Hedman, the VSCP project <info@vscp.org>

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  SOFTWARE.
*/

#include "vscp-compiler.h"
#include "vscp-projdefs.h"

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>

#include <esp_system.h>
#include <esp_partition.h>
#include <spi_flash_mmap.h>
#include <nvs_flash.h>
#include <esp_event.h>
#include <esp_netif.h>
#include <esp_log.h>
#include <mqtt_client.h>
#include "esp_task_wdt.h"
#include <esp_tls.h>
#include <esp_ota_ops.h>
#include <esp_mac.h> // esp_base_mac_addr_get
#include <sys/param.h>

#include <vscp.h>
#include <vscp-firmware-helper.h>

#include "can4vscp.h"
#include <main.h>
#include "mqtt.h"

// ============================================================================
//                              Global Variables
// ============================================================================

// Persistent configuration from main module
extern node_persistent_config_t g_persistent;

extern transport_t tr_mqtt;

// Logging tag for ESP-IDF logger
static const char *TAG = "MQTT";

// MQTT client handle for ESP-IDF MQTT library
esp_mqtt_client_handle_t g_mqtt_client;

// Connection state flag - true when connected to MQTT broker
static bool s_mqtt_connected = false;

// MQTT statistics: tracks publish counts, failures, and connection events
static mqtt_stats_t s_mqtt_statistics = { 0 };

// MQTT callback handoff queue (keep callback work minimal)
#define MQTT_RX_QUEUE_LEN       10
#define MQTT_RX_TOPIC_MAX_LEN   128
#define MQTT_RX_PAYLOAD_MAX_LEN 2048

typedef struct {
  size_t topic_len;
  size_t payload_len;
  char topic[MQTT_RX_TOPIC_MAX_LEN];
  char payload[MQTT_RX_PAYLOAD_MAX_LEN];
} mqtt_rx_msg_t;

static QueueHandle_t s_mqtt_rx_queue = NULL;

// ============================================================================
//                          Certificate Data (Legacy)
// ============================================================================

// Legacy: Embedded Eclipse IoT certificate (not used when TLS is configured via web UI)
// These are kept for backward compatibility but dynamic certificates from
// g_persistent.mqttCaCert/mqttClientCert/mqttClientKey are preferred
extern const uint8_t mqtt_eclipse_io_pem_start[] asm("_binary_mqtt_eclipse_io_pem_start");
extern const uint8_t mqtt_eclipse_io_pem_end[] asm("_binary_mqtt_eclipse_io_pem_end");

///////////////////////////////////////////////////////////////////////////////
// send_binary
//
//
// Note: this function is for testing purposes only publishing part of the active partition
//       (to be checked against the original binary)
//

// static void
// send_binary(esp_mqtt_client_handle_t client)
// {
//   spi_flash_mmap_handle_t out_handle;
//   const void *binary_address;
//   const esp_partition_t *partition = esp_ota_get_running_partition();
//   esp_partition_mmap(partition, 0, partition->size, SPI_FLASH_MMAP_DATA, &binary_address, &out_handle);
//   // sending only the configured portion of the partition (if it's less than the partition size)
//   int binary_size = MIN(4096, partition->size);
//   int msg_id      = esp_mqtt_client_publish(client, "/topic/binary", binary_address, binary_size, 0, 0);
//   ESP_LOGI(TAG, "binary sent with msg_id=%d", msg_id);
// }

// ============================================================================
//                          Topic Substitution
// ============================================================================

/**
 * @brief Perform mustache-style template substitution in MQTT topic strings
 *
 * This function replaces template tags (e.g., {{guid}}, {{class}}) with actual
 * values from the node configuration and/or VSCP event. This enables dynamic
 * topic generation based on event content and node identity.
 *
 * Supported substitution tags:
 * - {{node}}       : Node name from configuration
 * - {{guid}}       : Node GUID (16-byte hex string with colons)
 * - {{evguid}}     : Event GUID (requires pev)
 * - {{class}}      : VSCP event class number (requires pev)
 * - {{type}}       : VSCP event type number (requires pev)
 * - {{nickname}}   : Node nickname (LSB 2 bytes of GUID as decimal)
 * - {{evnickname}} : Event source nickname (requires pev)
 * - {{sindex}}     : Sensor index for measurement events (requires pev)
 *
 * Example:
 *   Input:  "vscp/{{guid}}/{{class}}/{{type}}"
 *   Output: "vscp/FF:FF:FF:FF:FF:FF:FF:F5:01:00:00:00:00:00:00:02/20/9"
 *
 * @param newTopic  Buffer to store the substituted topic string
 * @param len       Size of newTopic buffer
 * @param pTopic    Template topic string with {{tags}} to substitute
 * @param pev       Pointer to VSCP event (can be NULL if event tags not needed)
 *
 * @return VSCP_ERROR_SUCCESS on success, VSCP_ERROR_MEMORY if allocation fails
 */
static int
mqtt_topic_subst(char *newTopic, size_t len, const char *pTopic, const vscpEvent *pev)
{
  char workbuf[48];

