grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
  // Supported mustache template tags (currently implemented subset):
  // {{node}}      - Node name
  // {{guid}}      - Node GUID
  // {{evguid}}    - Event GUID
  // {{class}}     - Event class
  // {{type}}      - Event type
  // {{nickname}}  - Node nickname (16-bit)
  // {{evnickname}}- Event source nickname (16-bit)
  // {{sindex}}    - Sensor index (measurements only)
  //
  // Note: Additional tags like {{timestamp}}, {{zone}}, {{subzone}}, {{d[n]}},
  //       date/time fields are planned but not yet implemented
  //
  // Example: "vscp/{{guid}}/{{class}}/{{type}}" becomes
  //          "vscp/FF:FF:FF:FF:FF:FF:FF:F5:01:00:00:00:00:00:00:02/20/9"

  // Copy template topic to output buffer
  strncpy(newTopic, pTopic, MIN(len, strlen(pTopic)));

  // Allocate temporary buffer for iterative substitution
  char *saveTopic = (char *) calloc(1, len);
  if (NULL == saveTopic) {
    return VSCP_ERROR_MEMORY;
  }

  // Substitute {{node}} with configured node name
  vscp_fwhlp_strsubst(newTopic, len, pTopic, "{{node}}", g_persistent.nodeName);
  ESP_LOGV(TAG, "Substituted {{node}}: %s", newTopic);
  strncpy(saveTopic, newTopic, MIN(strlen(newTopic), len));

  // Substitute {{guid}} with node GUID (format: XX:XX:XX:...)
  vscp_fwhlp_writeGuidToString(workbuf, g_persistent.guid);
  vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{guid}}", workbuf);
  strcpy(saveTopic, newTopic);

  // Process event-specific tags only if event pointer provided
  if (NULL != pev) {

    // Event GUID
    vscp_fwhlp_writeGuidToString(workbuf, pev->GUID);
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{evguid}}", workbuf);
    strcpy(saveTopic, newTopic);

    // Class
    sprintf(workbuf, "%d", pev->vscp_class);
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{class}}", workbuf);
    strcpy(saveTopic, newTopic);

    // Type
    sprintf(workbuf, "%d", pev->vscp_type);
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{type}}", workbuf);
    strcpy(saveTopic, newTopic);

    // nickname
    sprintf(workbuf, "%d", ((g_persistent.guid[14] << 8) + (g_persistent.guid[15])));
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{nickname}}", workbuf);
    strcpy(saveTopic, newTopic);

    // event nickname
    sprintf(workbuf, "%d", ((pev->GUID[14] << 8) + (pev->GUID[15])));
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{evnickname}}", workbuf);
    strcpy(saveTopic, newTopic);

    // sensor index
    if (VSCP_ERROR_SUCCESS == vscp_fwhlp_isMeasurement(pev)) {
      sprintf(workbuf, "%d", vscp_fwhlp_getMeasurementSensorIndex(pev));
    }
    else {
      memset(workbuf, 0, sizeof(workbuf));
    }
    vscp_fwhlp_strsubst(newTopic, len, saveTopic, "{{sindex}}", workbuf);
    strcpy(saveTopic, newTopic);
  }

  free(saveTopic);

  return VSCP_ERROR_SUCCESS;
}

// Buffer size for topic substitution and JSON conversion
#define MQTT_SUBST_BUF_LEN 3000

// ============================================================================
//                          VSCP Event Publishing
// ============================================================================

/**
 * @brief Publish a VSCP event to the MQTT broker as JSON
 *
 * Converts the VSCP event to JSON format and publishes it to the specified
 * MQTT topic. If no topic is provided, uses the default publish topic from
 * configuration. Topic templates are expanded using mqtt_topic_subst().
 *
 * The event is serialized to JSON using vscp_fwhlp_create_json() which creates
 * a standard VSCP JSON representation containing timestamp, class, type, GUID,
 * and data fields.
 *
 * @param topic  MQTT topic string (may contain {{tags}}), or NULL for default
 * @param pev    Pointer to VSCP event to publish (must not be NULL)
 *
 * @return VSCP_ERROR_SUCCESS on success
 *         VSCP_ERROR_INVALID_POINTER if pev is NULL
 *         VSCP_ERROR_MEMORY if buffer allocation fails
 *         Error code from vscp_fwhlp_create_json() on JSON conversion failure
 *
 * @note If MQTT is not connected, increments failure counter and returns success
 * @note Updates s_mqtt_statistics.nPub on success or .nPubFailures on failure
 */
// int
// mqtt_send_vscp_event(const char *topic, const vscpEvent *pev)
// {
//   int rv             = VSCP_ERROR_SUCCESS;
//   const char *pTopic = topic;

//   // Check event pointer
//   if (NULL == pev) {
//     return VSCP_ERROR_INVALID_POINTER;
//   }

//   // Use default publish topic from config if none specified
//   if (NULL == topic) {
//     pTopic = g_persistent.mqttPubTopic;
//   }

//   // Silently fail if not connected (count as failure but return success)
//   if (!s_mqtt_connected) {
//     s_mqtt_statistics.nPubFailures++;
//     return VSCP_ERROR_SUCCESS;
//   }

//   // Allocate buffer for JSON conversion of VSCP event
//   char *pbuf = malloc(MQTT_SUBST_BUF_LEN);
//   if (NULL == pbuf) {
//     ESP_LOGE(TAG, "Unable to allocate JSON buffer for conversion");
//     return VSCP_ERROR_MEMORY;
//   }

//   // Determine the format to use for the MQTT message
//   switch (g_persistent.mqttFormat) {
//     case MQTT_FORMAT_JSON:
//       rv = vscp_fwhlp_create_json(pbuf, MQTT_SUBST_BUF_LEN, pev);
//       break;

//     case MQTT_FORMAT_XML:
//       //rv = vscp_fwhlp_create_xml(pbuf, MQTT_SUBST_BUF_LEN, pev);
//       break;

//     case MQTT_FORMAT_STRING:
//       rv = vscp_fwhlp_eventToString(pbuf, MQTT_SUBST_BUF_LEN, pev);
//       break;

//     case MQTT_FORMAT_BINARY:
//       //rv = vscp_fwhlp_create_binary(pbuf, MQTT_SUBST_BUF_LEN, pev);
//       break;

//     default:
//       ESP_LOGE(TAG, "Unsupported MQTT format");
//       free(pbuf);
//       return VSCP_ERROR_INVALID_SYNTAX;
//   }

//   if (VSCP_ERROR_SUCCESS != rv) {
//     free(pbuf);
//     ESP_LOGE(TAG, "Failed to convert event to selected format rv = %d", rv);
//     return rv;
//   }

//   ESP_LOGV(TAG, "Event converted to JSON format");

//   // Allocate buffer for topic template expansion
//   char *newTopic = calloc(MQTT_SUBST_BUF_LEN, 1);
//   if (NULL == newTopic) {
//     ESP_LOGE(TAG, "Unable to allocate memory.");
//     free(pbuf);
//     return VSCP_ERROR_MEMORY;
//   }

//   // Expand topic template with event-specific values
//   mqtt_topic_subst(newTopic, MQTT_SUBST_BUF_LEN, pTopic, pev);
//   ESP_LOGV(TAG, "Expanded MQTT topic: %s", newTopic);

//   // Publish JSON payload to MQTT broker with configured QoS and retain flag
//   int msgid =
//     esp_mqtt_client_publish(g_mqtt_client, newTopic, pbuf, strlen(pbuf), g_persistent.mqttQos, g_persistent.mqttRetain);

//   // Update statistics based on publish result
//   if (-1 != msgid) {
//     s_mqtt_statistics.nPub++;
//   }
//   else {
//     s_mqtt_statistics.nPubFailures++;
//     ESP_LOGE(TAG,
//              "Failed to publish MQTT message. id=%d Topic=%s outbox-size = %d",
//              msgid,
//              newTopic,
//              esp_mqtt_client_get_outbox_size(g_mqtt_client));
//   }

//   free(newTopic);
//   free(pbuf);

//   return VSCP_ERROR_SUCCESS;
// }

// ============================================================================
//                              Logging
// ============================================================================

/**
 * @brief Publish a log message to the MQTT broker
 *
 * Publishes plain text log messages to the configured log topic. This allows
 * remote monitoring of device logs via MQTT. The log topic is separate from
 * the event publish topic and can include template tags.
 *
 * @param msg  Log message string to publish (plain text)
 *
 * @return VSCP_ERROR_SUCCESS on success
 *         VSCP_ERROR_MEMORY if buffer allocation fails
 *
 * @note If log topic is not configured (empty string), function returns immediately
 * @note Updates s_mqtt_statistics.nPubLog on success or .nPubLogFailures on failure
 */
int
mqtt_log(char *msg)
{
  char *pbuf = msg;

