grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
  // Nothing to do if message is empty
  if (!strlen(msg)) {
    return VSCP_ERROR_SUCCESS;
  }

  // Only publish if log topic is configured
  if (strlen(g_persistent.mqttPubLogTopic)) {

    char *newTopic = calloc(MQTT_SUBST_BUF_LEN, 1);
    if (NULL == newTopic) {
      ESP_LOGE(TAG, "Unable to allocate memory.");
      free(pbuf);
      return VSCP_ERROR_MEMORY;
    }

    // Expand log topic template (no event context)
    const char *pTopic = g_persistent.mqttPubLogTopic;
    mqtt_topic_subst(newTopic, MQTT_SUBST_BUF_LEN, pTopic, NULL);

    // Publish log message with configured QoS and retain flag
    int msgid = esp_mqtt_client_publish(g_mqtt_client,
                                        newTopic,
                                        pbuf,
                                        strlen(pbuf),
                                        g_persistent.mqttQos,
                                        g_persistent.mqttRetain);
    if (-1 != msgid) {
      s_mqtt_statistics.nPubLog++;
    }
    else {
      s_mqtt_statistics.nPubLogFailures++;
      ESP_LOGE(TAG,
               "Failed to publish MQTT log message. id=%d Topic=%s outbox-size = %d",
               msgid,
               g_persistent.mqttPubLogTopic,
               esp_mqtt_client_get_outbox_size(g_mqtt_client));
    }

    free(newTopic);
  }

  return VSCP_ERROR_SUCCESS;
}

///////////////////////////////////////////////////////////////////////////////
// mqtt_task_tx
//
// From CAN
//
// This task receives VSCP events from the CAN queue, converts them to JSON,
// performs topic substitution, and publishes them to the MQTT broker. It runs
// continuously and handles all outgoing MQTT messages based on CAN events.

static void
mqtt_task_tx(void *pvParameters)
{
  int rv;
  can4vscp_frame_t rxmsg = {};

  ESP_LOGI(TAG, "MQTT rx (from CAN) task started");

  // Add the task to the watchdog timer
  // esp_task_wdt_add(NULL);

  while (1) {

    // esp_task_wdt_reset(); // Reset the watchdog timer

    long status = xQueueReceive(tr_mqtt.fromcan_queue, (void *) &rxmsg, 500);

    if (status == pdPASS) {
      ESP_LOGI(TAG, "Received message from CAN queue: ID=0x%X DLC=%d", rxmsg.identifier, rxmsg.data_length_code);
    }

    // Create a VSCP event from the received CAN message
    vscpEvent *pev;
    if (VSCP_ERROR_SUCCESS != (rv = can4vscp_msg_to_event(&pev, &rxmsg))) {
      ESP_LOGE(TAG, "Failed to convert CAN message to VSCP event rv=%d", rv);
      vscp_fwhlp_deleteEvent(&pev);
      continue;
    }

    char buf_msg[MQTT_SUBST_BUF_LEN]   = { 0 };
    char buf_topic[MQTT_SUBST_BUF_LEN] = { 0 };

    switch (g_persistent.mqttFormat) {

      case MQTT_FORMAT_JSON:
        // Create JSON representaion of the VSCP event for MQTT payload
        if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_create_json(buf_msg, sizeof(buf_msg), pev))) {
          ESP_LOGE(TAG, "Failed to convert VSCP event to JSON rv=%d", rv);
          vscp_fwhlp_deleteEvent(&pev);
          continue;
        }
        break;

      case MQTT_FORMAT_XML:
        ESP_LOGV(TAG, "XML format %s", buf_msg);
        if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_event_to_xml(buf_msg, sizeof(buf_msg), pev))) {
          ESP_LOGE(TAG, "Failed to convert VSCP event to XML rv=%d", rv);
          vscp_fwhlp_deleteEvent(&pev);
          continue;
        }

        break;

      case MQTT_FORMAT_STRING:
        // Create string representaion of the VSCP event for MQTT payload
        if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_eventToString(buf_msg, sizeof(buf_msg), pev))) {
          ESP_LOGE(TAG, "Failed to convert VSCP event to string rv=%d", rv);
          vscp_fwhlp_deleteEvent(&pev);
          continue;
        }
        break;

      case MQTT_FORMAT_BINARY:
        if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_writeEventToFrame((uint8_t *) buf_msg, sizeof(buf_msg), 0, pev))) {
          ESP_LOGE(TAG, "Failed to convert VSCP event to binary format rv=%d", rv);
          vscp_fwhlp_deleteEvent(&pev);
          continue;
        }
        break;

      default:
        ESP_LOGE(TAG, "Unsupported MQTT format");
        vscp_fwhlp_deleteEvent(&pev);
        continue;
    }

    // Create the dynamic topic name by substituting template tags with event values
    if (VSCP_ERROR_SUCCESS != mqtt_topic_subst(buf_topic, sizeof(buf_topic), g_persistent.mqttPubTopic, pev)) {
      ESP_LOGE(TAG, "Failed to substitute MQTT topic");
      continue;
    }

    // Event not needed anymore, free it before topic substitution
    vscp_fwhlp_deleteEvent(&pev);

    int msgid = esp_mqtt_client_publish(g_mqtt_client,
                                        buf_topic,
                                        buf_msg,
                                        strlen(buf_msg),
                                        g_persistent.mqttQos,
                                        g_persistent.mqttRetain);

    // vTaskDelay(pdMS_TO_TICKS(1000));
  }

  vTaskDelete(NULL);
}

///////////////////////////////////////////////////////////////////////////////
// mqtt_task_rx
//
// To CAN
//
// This task receives MQTT messages from the mqtt_event_handler via a queue,
// converts them to VSCP events, and forwards them to the CAN interface. It runs
// continuously and handles all incoming MQTT messages that are relevant to the gateway.

static void
mqtt_task_rx(void *pvParameters)
{
  int rv;
  ESP_LOGI(TAG, "MQTT rx (to CAN) task started");

  // Add the task to the watchdog timer
  // esp_task_wdt_add(NULL);

  while (1) {

    // esp_task_wdt_reset(); // Reset the watchdog timer

    mqtt_rx_msg_t rx = { 0 };
    long status      = xQueueReceive(s_mqtt_rx_queue, (void *) &rx, 500);
    if (status == pdPASS) {
      vscpEvent ev = { 0 };
      ESP_LOGV(TAG, "Received MQTT message: topic='%s' \npayload='%s'", rx.topic, rx.payload);

      switch (rx.payload[0]) {

        case '{': // Assume JSON payload
          if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_parse_json(&ev, rx.payload))) {
            ESP_LOGE(TAG, "Failed to parse MQTT JSON payload as VSCP event rv=%d", rv);
            continue;
          }
          break;

        case '<': // Assume XML payload (not implemented)
          if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_parse_xml_event(&ev, rx.payload))) {
            ESP_LOGE(TAG, "Failed to parse MQTT XML payload as VSCP event rv=%d", rv);
            continue;
          }
          break;

        case 0x00: // Assume binary payload (not implemented)
          ESP_LOGI(TAG, "Binary payload format not supported yet");
          // if (VSCP_ERROR_SUCCESS != vscp_fwhlp_parse_binary_event(&ev, rx.payload)) {
          //   ESP_LOGE(TAG, "Failed to parse MQTT binary payload as VSCP event");
          //   continue;
          // }
          continue;

        default: // Assume string payload
          if (VSCP_ERROR_SUCCESS != (rv = vscp_fwhlp_parseEvent(&ev, rx.payload))) {
            ESP_LOGE(TAG, "Failed to parse MQTT string payload as VSCP event rv=%d", rv);
            continue;
          }
          break;
      }

      can4vscp_frame_t txmsg = { 0 };
      txmsg.extd             = 1;
      txmsg.identifier       = ev.GUID[0] + (ev.vscp_type << 8) + (ev.vscp_class << 16) + (((ev.head >> 5) & 7) << 26);

      if (ev.sizeData > sizeof(txmsg.data)) {
        ESP_LOGW(TAG,
                 "VSCP event payload too large for CAN frame (%d), truncating to %d",
                 (int) ev.sizeData,
                 (int) sizeof(txmsg.data));
      }

      txmsg.data_length_code = MIN((size_t) ev.sizeData, sizeof(txmsg.data));
      if (txmsg.data_length_code > 0 && NULL != ev.pdata) {
        memcpy(txmsg.data, ev.pdata, txmsg.data_length_code);
      }

