grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
      if (ESP_OK != can4vscp_send(&txmsg, pdMS_TO_TICKS(100))) {
        ESP_LOGW(TAG, "Failed to transmit CAN frame from MQTT payload");
      }
      else {
        s_mqtt_statistics.nSub++;
        ESP_LOGI(TAG,
                 "MQTT->CAN forwarded topic=%s id=0x%X dlc=%d",
                 rx.topic,
                 txmsg.identifier,
                 txmsg.data_length_code);
      }

      if (NULL != ev.pdata) {
        free(ev.pdata);
        ev.pdata = NULL;
      }
    }
    vTaskDelay(pdMS_TO_TICKS(1000));
  }

  vTaskDelete(NULL);
}

// ============================================================================
//                          MQTT Event Handler
// ============================================================================

/**
 * @brief Event handler callback for MQTT client events
 *
 * This function is called by the ESP-IDF MQTT event loop for all MQTT-related
 * events including connection, disconnection, publish confirmation, incoming
 * data, subscriptions, and errors. It maintains connection state and statistics.
 *
 * Key functionality:
 * - Sets s_mqtt_connected flag on CONNECT/DISCONNECT
 * - Subscribes to configured topics on connection
 * - Updates statistics counters for all events
 * - Logs detailed error information for troubleshooting
 *
 * @param handler_args User data registered with the event (unused)
 * @param base         Event base identifier (ESP_EVENT_MQTT_BASE)
 * @param event_id     Specific MQTT event type (MQTT_EVENT_*)
 * @param event_data   Event data structure (esp_mqtt_event_handle_t)
 */
static void
mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
  ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%d", base, (int) event_id);
  esp_mqtt_event_handle_t event   = event_data;
  esp_mqtt_client_handle_t client = event->client;
  int msg_id;
  switch ((esp_mqtt_event_id_t) event_id) {

    case MQTT_EVENT_BEFORE_CONNECT:
      ESP_LOGI(TAG, "Preparing to connect");
      break;

    case MQTT_EVENT_CONNECTED:
      s_mqtt_connected = true;
      s_mqtt_statistics.nConnect++;
      ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");

      // Subscribe to configured topics (TODO: make this configurable)
      msg_id = esp_mqtt_client_subscribe(client, g_persistent.mqttSubTopic,
                                         0); // QoS 0
      ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_DISCONNECTED:
      s_mqtt_connected = false;
      s_mqtt_statistics.nDisconnect++;
      ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
      // esp_mqtt_client_reconnect(client);
      break;

    case MQTT_EVENT_SUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
      // Acknowledge successful subscription with status message
      // msg_id = esp_mqtt_client_publish(client, "esp-now/status", "Successful subscribe", 0, 0, 0);
      // ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_UNSUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_PUBLISHED:
      // Increment confirmation counter (for QoS > 0)
      s_mqtt_statistics.nPubConfirm++;
      ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_DATA:
      // Keep callback work minimal: copy payload/topic and hand off to worker task
      ESP_LOGI(TAG, "MQTT_EVENT_DATA");

      if ((event->total_data_len > event->data_len) || (event->current_data_offset > 0)) {
        ESP_LOGW(TAG,
                 "Fragmented MQTT payload not supported in callback handoff (%d/%d)",
                 event->data_len,
                 event->total_data_len);
        break;
      }

      if (NULL == s_mqtt_rx_queue) {
        ESP_LOGW(TAG, "MQTT RX queue not initialized");
        break;
      }

      mqtt_rx_msg_t rx = { 0 };
      rx.topic_len     = MIN((size_t) event->topic_len, (size_t) (MQTT_RX_TOPIC_MAX_LEN - 1));
      rx.payload_len   = MIN((size_t) event->data_len, (size_t) (MQTT_RX_PAYLOAD_MAX_LEN - 1));

      if ((size_t) event->data_len >= MQTT_RX_PAYLOAD_MAX_LEN) {
        ESP_LOGW(TAG,
                 "Incoming MQTT payload truncated from %d to %d bytes",
                 event->data_len,
                 MQTT_RX_PAYLOAD_MAX_LEN - 1);
      }

      memcpy(rx.topic, event->topic, rx.topic_len);
      rx.topic[rx.topic_len] = '\0';

      memcpy(rx.payload, event->data, rx.payload_len);
      rx.payload[rx.payload_len] = '\0';

      if (pdPASS != xQueueSendToBack(s_mqtt_rx_queue, (void *) &rx, (TickType_t) 0)) {
        tr_mqtt.overruns++;
        ESP_LOGW(TAG, "MQTT RX queue full, dropping message");
      }
      break;

    case MQTT_EVENT_ERROR:
      s_mqtt_statistics.nErrors++;
      ESP_LOGI(TAG, "MQTT_EVENT_ERROR");

      // Detailed error logging for troubleshooting
      if (event->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
        // TLS/TCP transport errors (including certificate validation failures)
        ESP_LOGI(TAG, "Last error code reported from esp-tls: 0x%x", event->error_handle->esp_tls_last_esp_err);
        ESP_LOGI(TAG, "Last tls stack error number: 0x%x", event->error_handle->esp_tls_stack_err);
        ESP_LOGI(TAG,
                 "Last captured errno : %d (%s)",
                 event->error_handle->esp_transport_sock_errno,
                 strerror(event->error_handle->esp_transport_sock_errno));
      }
      else if (event->error_handle->error_type == MQTT_ERROR_TYPE_CONNECTION_REFUSED) {
        // MQTT protocol-level connection refusal (bad credentials, etc.)
        ESP_LOGI(TAG, "Connection refused error: 0x%x", event->error_handle->connect_return_code);
      }
      else {
        ESP_LOGW(TAG, "Unknown error type: 0x%x", event->error_handle->error_type);
      }
      break;

    default:
      ESP_LOGI(TAG, "Other event id:%d", event->event_id);
      break;
  }
}

// ============================================================================
//                          MQTT Client Control
// ============================================================================

/**
 * @brief Initialize and start the MQTT client
 *
 * This function creates and starts the MQTT client using configuration from
 * g_persistent. It supports both plain MQTT and MQTT over TLS/SSL with
 * optional client certificate authentication.
 *
 * Configuration sources:
 * - Broker: g_persistent.mqttUrl and mqttPort
 * - Credentials: mqttUser, mqttPw
 * - Client ID: mqttClientId (supports {{node}} and {{guid}} templates)
 * - TLS: enableMqttTls, mqttCaCert, mqttClientCert, mqttClientKey
 *
 * TLS Features:
 * - Automatic scheme selection (mqtt:// vs mqtts://)
 * - Server certificate verification via CA certificate
 * - Optional mutual TLS with client certificate and private key
 * - Certificates stored in PEM format (up to 1024 bytes each)
 *
 * @note Client ID templates are expanded before connection
 * @note Session is persistent (clean_session = false)
 * @note Keepalive interval is 60 seconds
 */
void
mqtt_start(void)
{
  ESP_LOGI(TAG, "Starting MQTT client");

  if (NULL == s_mqtt_rx_queue) {
    s_mqtt_rx_queue = xQueueCreate(MQTT_RX_QUEUE_LEN, sizeof(mqtt_rx_msg_t));
    if (NULL == s_mqtt_rx_queue) {
      ESP_LOGE(TAG, "Failed to create MQTT RX handoff queue");
      return;
    }
  }

  // Get base MAC address (used for unique identification if needed)
  uint8_t mac[8];
  ESP_ERROR_CHECK(esp_base_mac_addr_get(mac));

  char clientid[128], save[128], workbuf[48];

  memset(clientid, 0, sizeof(clientid));
  strncpy(clientid, g_persistent.mqttClientId, sizeof(clientid) - 1);

  // Expand client ID template: {{node}} → node name
  vscp_fwhlp_strsubst(clientid, sizeof(clientid), g_persistent.mqttClientId, "{{node}}", g_persistent.nodeName);
  strcpy(save, clientid);

  // Expand client ID template: {{guid}} → GUID string
  vscp_fwhlp_writeGuidToString(workbuf, g_persistent.guid);
  vscp_fwhlp_strsubst(clientid, sizeof(clientid), save, "{{guid}}", workbuf);

