grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
  char uri[256];
  // Build broker URI with appropriate scheme based on TLS setting
  // mqtt://  = plain TCP connection (port 1883 typical)
  // mqtts:// = TLS/SSL encrypted connection (port 8883 typical)
  if (g_persistent.enableMqttTls) {
    sprintf(uri, "mqtts://%s:%d", g_persistent.mqttUrl, g_persistent.mqttPort);
  }
  else {
    sprintf(uri, "mqtt://%s", g_persistent.mqttUrl);
    // sprintf(uri, "mqtt://%s:%d", g_persistent.mqttUrl, g_persistent.mqttPort);
  }

  ESP_LOGI(TAG, "MQTT client id: %s", clientid);

  // Configure MQTT client based on ESP-IDF version
  // clang-format off
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  // ESP-IDF v5.0+ configuration structure
  esp_mqtt_client_config_t mqtt_cfg = {
    .broker = { 
                .address.uri = uri,               // Complete URI with scheme
                .address.port = g_persistent.mqttPort,
              },    
    .session.disable_clean_session = true,          // Persistent session
    .session.keepalive = 60,                        // 60 second keepalive
    .credentials.username                = g_persistent.mqttUser,
    .credentials.authentication.password = g_persistent.mqttPw,
    .task.priority = 5,
  };

  // Only set client_id if it's not empty (ESP-IDF v5 allows empty client_id for auto-generated ID)
  if (strlen(clientid) > 0) {
    mqtt_cfg.credentials.client_id               = clientid;
  }

  // Configure TLS/SSL certificates if TLS is enabled
  // Certificates are in PEM format and stored in persistent config
  if (g_persistent.enableMqttTls) {
    // CA certificate for server verification (required for TLS)
    if (strlen(g_persistent.mqttCaCert) > 0) {
      mqtt_cfg.broker.verification.certificate = g_persistent.mqttCaCert;
      ESP_LOGI(TAG, "MQTT TLS: CA certificate configured");
    }
    // Client certificate for mutual TLS authentication (optional)
    if (strlen(g_persistent.mqttClientCert) > 0) {
      mqtt_cfg.credentials.authentication.certificate = g_persistent.mqttClientCert;
      ESP_LOGI(TAG, "MQTT TLS: Client certificate configured");
    }
    // Client private key for mutual TLS authentication (optional, pairs with client cert)
    if (strlen(g_persistent.mqttClientKey) > 0) {
      mqtt_cfg.credentials.authentication.key = g_persistent.mqttClientKey;
      ESP_LOGI(TAG, "MQTT TLS: Client private key configured");
    }
  }
#else
  // ESP-IDF v4.x configuration structure (legacy)
  esp_mqtt_client_config_t mqtt_cfg = {
    .uri          = uri,
    .event_handle = mqtt_event_handler,
    .client_id    = clientid
  };
#endif
  // clang-format on

  // Initialize MQTT client with configuration
  g_mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
  // Register event handler for all MQTT events
  if (ESP_OK != esp_mqtt_client_register_event(g_mqtt_client, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL)) {
    ESP_LOGE(TAG, "Failed to register MQTT event handler");
  }

  // Start the MQTT client (initiates connection to broker)
  if (ESP_OK != esp_mqtt_client_start(g_mqtt_client)) {
    ESP_LOGE(TAG, "Failed to start MQTT client");
  }

  // Create separate tasks for MQTT TX and RX processing
  // mqtt_task_tx handles outgoing messages based on CAN events
  // mqtt_task_rx handles incoming MQTT messages and converts them to CAN events
  xTaskCreate(mqtt_task_tx, "mqtt_tx", 1024 * 12, (void *) &tr_mqtt, 5, NULL);
  xTaskCreate(mqtt_task_rx, "mqtt_rx", 8192, (void *) &tr_mqtt, 5, NULL);

  ESP_LOGI(TAG, "Outbox-size = %d", esp_mqtt_client_get_outbox_size(g_mqtt_client));
}

/**
 * @brief Stop the MQTT client and disconnect from broker
 *
 * Cleanly shuts down the MQTT client connection. Should be called before
 * restarting WiFi or during device shutdown.
 */
void
mqtt_stop(void)
{
  esp_mqtt_client_stop(g_mqtt_client);
}
